In [2]:
import pandas as pd
index = [('California', 2000), ('California', 2010),
        ('New York', 2000), ('New York', 2010),
        ('Texas', 2000), ('Texas', 2010)]
populations = [1234567, 2345678, 3456789, 4567890, 9876543, 8765432]
pop = pd.Series(populations, index=index)
pop

(California, 2000)    1234567
(California, 2010)    2345678
(New York, 2000)      3456789
(New York, 2010)      4567890
(Texas, 2000)         9876543
(Texas, 2010)         8765432
dtype: int64

In [3]:
index = pd.MultiIndex.from_tuples(index)
index

MultiIndex(levels=[['California', 'New York', 'Texas'], [2000, 2010]],
           labels=[[0, 0, 1, 1, 2, 2], [0, 1, 0, 1, 0, 1]])

In [4]:
# multi level (hierarchical) index
pop = pop.reindex(index)
pop

California  2000    1234567
            2010    2345678
New York    2000    3456789
            2010    4567890
Texas       2000    9876543
            2010    8765432
dtype: int64

In [5]:
# all the populations in 2010 (with pandas slicing notation)
pop[:, 2010]

California    2345678
New York      4567890
Texas         8765432
dtype: int64

In [6]:
# Unstacking pivots the data
pop_df = pop.unstack()
pop_df

               2000     2010
California  1234567  2345678
New York    3456789  4567890
Texas       9876543  8765432

In [7]:
# Stacking reverts back to a hierarchy
pop_df.stack()

California  2000    1234567
            2010    2345678
New York    2000    3456789
            2010    4567890
Texas       2000    9876543
            2010    8765432
dtype: int64

In [8]:
# let's add another column
pop_df = pd.DataFrame({'total': pop,
                      'under18': [11111, 22222, 33333, 
                                 44444, 55555, 66666]})
pop_df

                   total  under18
California 2000  1234567    11111
           2010  2345678    22222
New York   2000  3456789    33333
           2010  4567890    44444
Texas      2000  9876543    55555
           2010  8765432    66666

In [9]:
# try a ufunc (division) and unstack
f_u18 = pop_df['under18'] / pop_df['total']
f_u18.unstack()

                2000      2010
California  0.009000  0.009474
New York    0.009643  0.009730
Texas       0.005625  0.007606

In [10]:
# creating from arrays
pd.MultiIndex.from_arrays([['a', 'b', 'c'], [1, 2, 3]])

MultiIndex(levels=[['a', 'b', 'c'], [1, 2, 3]],
           labels=[[0, 1, 2], [0, 1, 2]])

In [11]:
# explicitly passing the levels
pd.MultiIndex(levels=[['a', 'b'], [1, 2]],
             labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [12]:
# name the levels
pop.index.names = ['state', 'year']
pop

state       year
California  2000    1234567
            2010    2345678
New York    2000    3456789
            2010    4567890
Texas       2000    9876543
            2010    8765432
dtype: int64

In [13]:
# MultiIndex columns
index = pd.MultiIndex.from_product([[2013, 2014], [1, 2]],
                                  names=['year', 'visit'])
columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'], ['HR', 'Temp']],
                                    names=['subject', 'type'])
columns

MultiIndex(levels=[['Bob', 'Guido', 'Sue'], ['HR', 'Temp']],
           labels=[[0, 0, 1, 1, 2, 2], [0, 1, 0, 1, 0, 1]],
           names=['subject', 'type'])

In [14]:
# mock some data
import numpy as np
data = np.round(np.random.randn(4, 6), 1)
data[:, ::2] *= 10
data += 37

# create the DataFrame
health_data = pd.DataFrame(data, index=index, columns= columns)
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      42.0  35.0  26.0  35.6  27.0  36.0
     2      46.0  38.0  44.0  37.5  36.0  35.9
2014 1      30.0  37.5  41.0  35.5  45.0  36.9
     2      38.0  37.2  40.0  36.0  34.0  35.2

In [15]:
health_data['Guido']

type          HR  Temp
year visit
2013 1      26.0  35.6
     2      44.0  37.5
2014 1      41.0  35.5
     2      40.0  36.0

## Indexing and slicing a MultiIndex

In [19]:
pop['California', 2010]

2345678

In [21]:
pop.loc['California':'New York', 2010]

state       year
California  2010    2345678
New York    2010    4567890
dtype: int64

In [25]:
pop[pop > 2000]

state       year
California  2000    1234567
            2010    2345678
New York    2000    3456789
            2010    4567890
Texas       2000    9876543
            2010    8765432
dtype: int64

## Re-arranging Multi-Indices

In [43]:
index = pd.MultiIndex.from_product([['a', 'c', 'b'], [1, 2]])
data = pd.Series(np.random.rand(6), index=index)
data.index.names = ['char', 'int']
data

char  int
a     1      0.482932
      2      0.832293
c     1      0.910838
      2      0.552028
b     1      0.059219
      2      0.441987
dtype: float64

In [44]:
# index must be sorted before partial slicing on that index
try:
    data['a':'b']
except KeyError as e:
    print(type(e))
    print(e)

<class 'pandas.errors.UnsortedIndexError'>
'Key length (1) was greater than MultiIndex lexsort depth (0)'

In [45]:
# sort the index
data = data.sort_index()
data

char  int
a     1      0.482932
      2      0.832293
b     1      0.059219
      2      0.441987
c     1      0.910838
      2      0.552028
dtype: float64

In [46]:
data['a':'b']

char  int
a     1      0.482932
      2      0.832293
b     1      0.059219
      2      0.441987
dtype: float64

In [50]:
# convert from stacked mult-index to two dimensions
pop.unstack(level=0)

state  California  New York    Texas
year
2000      1234567   3456789  9876543
2010      2345678   4567890  8765432

In [51]:
# setting and resetting index
pop_flat = pop.reset_index(name='population')
pop_flat

        state  year  population
0  California  2000     1234567
1  California  2010     2345678
2    New York  2000     3456789
3    New York  2010     4567890
4       Texas  2000     9876543
5       Texas  2010     8765432

In [54]:
pop_flat.set_index(['state', 'year'])

                 population
state      year
California 2000     1234567
           2010     2345678
New York   2000     3456789
           2010     4567890
Texas      2000     9876543
           2010     8765432

In [58]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      42.0  35.0  26.0  35.6  27.0  36.0
     2      46.0  38.0  44.0  37.5  36.0  35.9
2014 1      30.0  37.5  41.0  35.5  45.0  36.9
     2      38.0  37.2  40.0  36.0  34.0  35.2

In [57]:
health_data.mean(level='year')

subject   Bob        Guido          Sue
type       HR   Temp    HR   Temp    HR   Temp
year
2013     44.0  36.50  35.0  36.55  31.5  35.95
2014     34.0  37.35  40.5  35.75  39.5  36.05